Repository: HaleXie/HLSDK-SPM
Catalog: Sources/HLSDKResources/Resources/Branding/texts.xcstrings
Source language: en
Languages: de, es, fr, it, ja, ko, pt_pt, zh_hans

source: Area Name
de: Gebietsname
es: Nombre del área
fr: Nom de la zone
it: Nome dell'area
ja: エリア名
ko: 지역 이름
pt_pt: Nome da área
zh_hans: 区域名称

source: Areas
de: Bereiche
es: Áreas
fr: Zones
it: Aree
ja: エリア
ko: 지역
pt_pt: Áreas
zh_hans: 区域

# ArrowLabel
source: Arrow
de: Pfeil
es: Flecha
fr: Flèche
it: Freccia
ja: 矢印
ko: 화살
pt_pt: Flecha
zh_hans: 箭头

# AskToRemoveParticipant
source: Are you sure you want to remove %@?
de: Möchten Sie %@ wirklich entfernen?
es: ¿Estás seguro de que quieres eliminar %@ ?
fr: Voulez-vous vraiment supprimer %@ ?
it: Sei sicuro di voler rimuovere %@ ?
ja: %@を削除してもよろしいですか？
ko: %@ 을 제거 하시겠습니까?
pt_pt: Tem certeza que deseja remover %@ ?
zh_hans: 您确定要删除%@吗？

source: Assign
de: Zuordnen
es: Asignar
fr: Attribuer
it: Assegnare
ja: 割当
ko: 양수인
pt_pt: Atribuir
zh_hans: 分配

source: Assign Procedure
de: Verfahren zuweisen
es: Asignar procedimiento
fr: Attribuer une procédure
it: Assegna procedura
ja: 手順を割り当て
ko: 절차 할당
pt_pt: Atribuir procedimento
zh_hans: 分配流程

source: Attach
de: Anhängen
es: Adjuntar
fr: Joindre
it: Allega
ja: 添付
ko: 첨부
pt_pt: Anexar
zh_hans: 附加

# AttachedProcedureStateCompleted
source: Completed
de: Vollendet
es: Terminado
fr: Complété
it: Completato
ja: 完了
ko: 완전한
pt_pt: Concluído
zh_hans: 完成的

# AttachedProcedureStateInProgress
source: In progress
de: Im Gange
es: En curso
fr: En cours
it: In corso
ja: 進行中
ko: 진행 중
pt_pt: Em andamento
zh_hans: 进行中

source: Attach from Knowledge
de: Aus Wissensbasis anhängen
es: Adjuntar desde conocimiento
fr: Joindre depuis la base de connaissances
it: Allega dalla knowledge base
ja: ナレッジから添付
ko: 지식에서 첨부
pt_pt: Anexar do conhecimento
zh_hans: 从知识库附加

source: Attachment
de: Anhang
es: Adjunto
fr: Pièce jointe
it: Allegato
ja: 添付ファイル
ko: 첨부 파일
pt_pt: Anexo
zh_hans: 附件

source: Attach to Existing Help Thread
de: An bestehenden Hilfe-Thread anhängen
es: Adjuntar a hilo de ayuda existente
fr: Joindre à un fil d'aide existant
it: Allega a thread di assistenza esistente
ja: 既存のヘルプスレッドに添付
ko: 기존 도움말 스레드에 첨부
pt_pt: Anexar a tópico de ajuda existente
zh_hans: 附加到现有帮助对话

source: Attach to help thread
de: An Hilfe-Thread anhängen
es: Adjuntar al hilo de ayuda
fr: Joindre au fil d'aide
it: Allega alla discussione di aiuto
ja: ヘルプスレッドに添付
ko: 도움말 스레드에 첨부
pt_pt: Anexar ao tópico de ajuda
zh_hans: 附加到帮助主题

# AttemptToUnlockPDF
source: Attempt to unlock PDF with entered password
de: Versuchen, die PDF mit dem eingegebenen Passwort zu entsperren
es: Intentar desbloquear el PDF con la contraseña ingresada
fr: Tenter de déverrouiller le PDF avec le mot de passe saisi
it: Tentativo di sbloccare il PDF con la password inserita
ja: 入力したパスワードで PDF のロック解除を試行
ko: 입력한 비밀번호로 PDF 잠금 해제 시도
pt_pt: Tentar desbloquear o PDF com a palavra-passe introduzida
zh_hans: 尝试使用输入的密码解锁 PDF

# Audio
source: Ultra-Low Bandwidth
de: Ultra-niedrige Bandbreite
es: Ancho de banda ultrabajo
fr: Bande passante faible
it: Larghezza di banda ultra ridotta
ja: 超低帯域幅
ko: 초저대역폭
pt_pt: Largura de banda ultrabaixa
zh_hans: 超低带宽

# AudioOnly
source: Ultra-Low Bandwidth Mode
de: Ultra-Low-Bandwidth-Modus
es: Modo de ancho de banda ultrabajo
fr: Mode bande passante faible
it: Modalità larghezza di banda ultra ridotta
ja: 超低帯域幅モード
ko: 초저대역폭 모드
pt_pt: Modo de largura de banda ultrabaixa
zh_hans: 超低带宽模式

source: Audio Settings
de: Audio Einstellungen
es: Configuraciones de audio
fr: Les paramètres audio
it: Impostazioni audio
ja: オーディオ設定
ko: 오디오 설정
pt_pt: Configurações de áudio
zh_hans: 音频设置

# AudioSettingsDescription
source: Manage audio settings
de: Audio-Einstellungen verwalten
es: Administrar configuraciones de audio
fr: Gérer les paramètres audio
it: Gestisci impostazioni audio
ja: オーディオ設定を管理
ko: 오디오 설정 관리
pt_pt: Gerir definições de áudio
zh_hans: 管理音频设置

source: Authenticating...
de: Authentifizierung...
es: Autenticando...
fr: Authentification...
it: Autenticazione in corso...
ja: 認証中...
ko: 인증 중...
pt_pt: Autenticando...
zh_hans: 正在验证...

# AUTHENTICATION_EXCEPTION_200
source: Authentication Exception
de: Authentifizierungsausnahme
es: Excepción de autenticación
fr: Exception d'authentification
it: Eccezione di autenticazione
ja: 認証例外
ko: 인증 예외
pt_pt: Erro de autenticação
zh_hans: 身份验证异常

# AUTHENTICATION_FAILED_201
source: The email or password was incorrect.
de: Die E-Mail oder das Passwort war falsch.
es: El correo electrónico o la contraseña eran incorrectos.
fr: e-mail ou mot de passe était incorrect.
it: L'email o la password erano errate.
ja: メールアドレスかパスワードが間違っています。
ko: 이메일 또는 비밀번호가 잘못되었습니다.
pt_pt: O email ou senha estavam incorretos.
zh_hans: 邮箱或密码不正确

source: Authentication Failed
de: Authentifizierung fehlgeschlagen
es: Autenticación fallida
fr: Authentification échouée
it: Autenticazione fallita
ja: 認証失敗
ko: 인증 실패
pt_pt: Falha de autenticação
zh_hans: 认证失败

# AutoControlCameraHintsTitle
source: Point your device at a light colored background.
de: Richten Sie Ihr Gerät auf einen hellen Hintergrund.
es: Apunte su dispositivo hacia un fondo de color claro.
fr: Pointez votre appareil sur un arrière-plan de couleur claire.
it: Puntare il dispositivo su uno sfondo di colore chiaro.
ja: デバイスを明るい色の背景に向けます。
ko: 장치의 카메라가 밝은 색의 배경을 향하도록 하세요
pt_pt: Aponte o seu dispositivo para um fundo de cor clara.
zh_hans: 请将您的设备指向浅色背景

# AutoEnableCamera
source: Join Call With Camera On
de: An Anruf bei eingeschalteter Kamera teilnehmen
es: Unirse a la llamada con la cámara encendida
fr: Rejoindre l'appel avec la caméra allumée
it: Partecipa alla chiamata con la fotocamera accesa
ja: カメラをオンにして通話に参加する
ko: 카메라가 켜진 상태에서 통화 참여
pt_pt: Junte-se à chamada com a câmera ligada
zh_hans: 打开摄像头加入通话

# AutoguideTitle
source: What are Help Threads?
de: Was sind Hilfe-Threads?
es: ¿Qué son los hilos de ayuda?
fr: Que sont les fils d’aide?
it: Cosa sono i thread di aiuto?
ja: ヘルプスレッドとは何ですか?
ko: 도움말 스레드란 무엇인가요?
pt_pt: O que são tópicos de ajuda?
zh_hans: 什么是帮助主题？

source: Avatar
de: Benutzerbild
ja: アバター
ko: 아바타
zh_hans: 头像

source: AWS manager not ready
de: AWS-Manager nicht bereit
es: Administrador de AWS no está listo
fr: Gestionnaire AWS non prêt
it: Gestore AWS non pronto
ja: AWSマネージャーが準備できていません
ko: AWS 관리자가 준비되지 않았습니다
pt_pt: Gestor AWS não está pronto
zh_hans: AWS管理器未就绪

source: Back
de: Zurück
es: Atrás
fr: Retour
it: Indietro
ja: バック
ko: 뒤
pt_pt: Retornar
zh_hans: 返回

# BackButton
source: Back
de: Zurück
es: Atrás
fr: Retour
it: Indietro
ja: 戻る
ko: 뒤로
pt_pt: Voltar
zh_hans: 返回

source: Back Camera
de: Rückseitige Kamera
es: Camara trasera
fr: Caméra arrière
it: Fotocamera posteriore
ja: バックカメラ
ko: 후면 카메라
pt_pt: Câmera traseira
zh_hans: 后置摄像头

source: Back to Chat
de: Zurück zum Chat
es: Volver al chat
fr: Retour au chat
it: Torna alla chat
ja: チャットに戻る
ko: 채팅으로 돌아가기
pt_pt: Voltar ao chat
zh_hans: 返回聊天

source: Back to Live Video
de: Zurück zum Live-Video
es: Volver al vídeo en vivo
fr: Retour à la vidéo en direct
it: Torna al video in diretta
ja: ライブビデオに戻る
ko: 라이브 비디오로 돌아가기
pt_pt: Voltar ao vídeo ao vivo
zh_hans: 返回直播视频

source: Become available
de: Verfügbar werden
es: Vuelve disponible
fr: Devenir disponible
it: Diventa disponibile
ja: 対応可能にする
ko: 이용 가능
pt_pt: Tornar-se disponível
zh_hans: 上线

# BLACKLISTED_MOBILE_NUMBER_1050
source: Cannot send SMS. Number has been blacklisted.
de: SMS kann nicht gesendet werden. Die Nummer wurde auf die schwarze Liste gesetzt.
es: No se pueden enviar SMS. El número ha sido incluido en la lista negra.
fr: Impossible d'envoyer des SMS. Le numéro a été mis sur liste noire.
it: Impossibile inviare SMS. Il numero è stato nella lista nera.
ja: SMSを送信できません。電話番号が着信拒否リストに入っています。
ko: SMS를 보낼 수 없습니다. 번호가 블랙리스트에 올랐습니다.
pt_pt: Não é possível enviar SMS. O número foi colocado na lista negra.
zh_hans: 无法发送短信，此号码已被列入黑名单。

# BlockNotificationsAndCallsDuringSelected
source: Block notifications and calls during selected hours
de: Benachrichtigungen und Anrufe während der ausgewählten Stunden blockieren
es: Bloquear notificaciones y llamadas durante las horas seleccionadas
fr: Bloquer les notifications et les appels pendant les heures sélectionnées
it: Blocca notifiche e chiamate durante le ore selezionate
ja: 選択した時間帯に通知と通話をブロック
ko: 선택한 시간 동안 알림 및 통화 차단
pt_pt: Bloquear notificações e chamadas durante as horas selecionadas
zh_hans: 在选定时段内屏蔽通知和通话

# BugReportAddAttachment
source: Add
de: Anhang hinzufügen
es: Añadir adjunto
fr: Ajouter une pièce jointe
it: Aggiungi allegato
ja: 添付を追加
ko: 첨부 추가
pt_pt: Adicionar anexo
zh_hans: 添加附件

# BugReportAddFile
source: File
de: Datei
es: Archivo
fr: Fichier
ja: ファイル
ko: 파일
pt_pt: Ficheiro
zh_hans: 文件

# BugReportAddFileAccessibility
source: Add file attachment
de: Dateianhang hinzufügen
es: Añadir archivo adjunto
fr: Ajouter un fichier joint
it: Aggiungi file allegato
ja: ファイルを添付
ko: 파일 첨부 추가
pt_pt: Adicionar ficheiro em anexo
zh_hans: 添加文件附件

# BugReportAddPhoto
source: Photo
de: Foto
es: Foto
it: Foto
ja: 写真
ko: 사진
pt_pt: Foto
zh_hans: 照片

# BugReportAddPhotoAccessibility
source: Add photo from library
de: Foto aus Bibliothek hinzufügen
es: Añadir foto de la biblioteca
fr: Ajouter une photo de la bibliothèque
it: Aggiungi foto dalla libreria
ja: ライブラリから写真を追加
ko: 라이브러리에서 사진 추가
pt_pt: Adicionar foto da biblioteca
zh_hans: 从相册添加照片

# BugReportAppLogsAttached
source: A log archive will be attached to this report.
de: Ein Protokollarchiv wird an diesen Bericht angehängt.
es: Se adjuntará un archivo de registro a este informe.
fr: Une archive de journaux sera jointe à ce rapport.
it: Un archivio dei log verrà allegato a questa segnalazione.
ja: ログアーカイブがこのレポートに添付されます。
ko: 이 보고에 로그 아카이브가 첨부됩니다.
pt_pt: Um arquivo de registos será anexado a este relatório.
zh_hans: 日志存档将附加到此报告。

# BugReportAttachmentsLabel
source: Attachments
de: Anhänge
es: Adjuntos
fr: Pièces jointes
it: Allegati
ja: 添付ファイル
ko: 첨부 파일
pt_pt: Anexos
zh_hans: 附件

# BugReportContactAccessibility
source: Contact identity for this report
de: Kontaktidentität für diesen Bericht
es: Identidad de contacto para este informe
fr: Identité de contact pour ce rapport
it: Identità di contatto per questo rapporto
ja: このレポートの連絡先
ko: 이 보고서의 연락처
pt_pt: Identidade de contacto para este relatório
zh_hans: 此报告的联系方式

# BugReportContactLabel
source: Contact
de: Kontakt
es: Contacto
it: Contatto
ja: 連絡先
ko: 연락처
pt_pt: Contacto
zh_hans: 联系方式

# BugReportDescriptionAccessibility
source: Problem description
de: Problembeschreibung
es: Descripción del error
fr: Description du problème
it: Descrizione del problema
ja: 問題の説明
ko: 문제 설명
pt_pt: Descrição do erro
zh_hans: 错误描述

# BugReportDescriptionHint
source: Describe the issue you encountered
de: Beschreiben Sie das aufgetretene Problem
es: Describa el problema encontrado
fr: Décrivez le problème rencontré
it: Descrivi il problema riscontrato
ja: 発生した問題を説明してください
ko: 발생한 문제를 설명해 주세요
pt_pt: Descreva o problema encontrado
zh_hans: 描述您遇到的问题

# BugReportDescriptionLabel
source: What went wrong?
de: Was ist schiefgelaufen?
es: ¿Qué salió mal?
fr: Que s'est-il passé ?
it: Cosa è andato storto?
ja: 何が問題でしたか？
ko: 무엇이 잘못되었나요?
pt_pt: O que correu mal?
zh_hans: 出了什么问题？

# BugReportDescriptionPlaceholder
source: Describe the issue…
de: Beschreiben Sie das Problem…
es: Describa el problema…
fr: Décrivez le problème…
it: Descrivi il problema…
ja: 問題を説明してください…
ko: 문제를 설명해 주세요…
pt_pt: Descreva o problema…
zh_hans: 请描述问题…

# BugReportFloatingButton
source: Floating Problem Report Button
de: Schwebende Problem-Meldetaste
es: Botón flotante de informe de problemas
fr: Bouton flottant de signalement de problème
it: Pulsante mobile per segnalare un problema
ja: フローティング問題報告ボタン
ko: 플로팅 문제 신고 버튼
pt_pt: Botão flutuante de relatório de problema
zh_hans: 悬浮问题报告按钮

# BugReportFloatingButtonAccessibilityHint
source: Opens the problem report form
de: Öffnet das Problemberichtformular
es: Abre el formulario de informe de errores
fr: Ouvre le formulaire de signalement de problème
it: Apre il modulo di segnalazione del problema
ja: 問題報告フォームを開きます
ko: 문제 신고 양식을 엽니다
pt_pt: Abre o formulário de relatório de erro
zh_hans: 打开错误报告表单

# BugReportFloatingButtonAccessibilityLabel
source: Report a problem
de: Problem melden
es: Informar de un problema
fr: Signaler un problème
it: Segnala un problema
ja: 問題を報告
ko: 문제 신고
pt_pt: Reportar um problema
zh_hans: 报告问题

# BugReportFloatingButtonDescription
source: Show a movable button to quickly file a problem report anytime
de: Zeigt eine verschiebbare Taste an, um jederzeit schnell einen Problembericht zu erstellen
es: Muestra un botón movible para enviar rápidamente un informe de errores en cualquier momento
fr: Affiche un bouton déplaçable pour signaler rapidement un problème à tout moment
it: Mostra un pulsante mobile per inviare rapidamente una segnalazione di problema in qualsiasi momento
ja: 移動可能なボタンを表示して、いつでもすぐに問題を報告できます
ko: 이동 가능한 버튼을 표시하여 언제든지 빠르게 문제를 신고합니다
pt_pt: Mostra um botão móvel para enviar rapidamente um relatório de erro a qualquer momento
zh_hans: 显示可移动的按钮，随时快速提交错误报告

# BugReportIncludeAppLogs
source: Include app logs
de: App-Protokolle einschließen
es: Incluir registros de la app
fr: Inclure les journaux de l'app
it: Includi i log dell'app
ja: アプリログを含める
ko: 앱 로그 포함
pt_pt: Incluir registos da app
zh_hans: 包含应用日志

# BugReportIncludeAppLogsDescription
source: Attach a log archive to this report
de: Ein Protokollarchiv an diesen Bericht anhängen
es: Adjuntar un archivo de registro a este informe
fr: Joindre une archive de journaux à ce rapport
it: Allega un archivio dei log a questa segnalazione
ja: ログアーカイブをこのレポートに添付する
ko: 이 보고에 로그 아카이브를 첨부
pt_pt: Anexar um arquivo de registos a este relatório
zh_hans: 将日志存档附加到此报告

# BugReportIncludeAppLogsHint
source: Enable to attach a log archive to the problem report
de: Aktivieren, um ein Protokollarchiv an den Problembericht anzuhängen
es: Activar para adjuntar un archivo de registro al informe de error
fr: Activer pour joindre une archive de journaux au signalement de problème
it: Attiva per allegare un archivio dei log alla segnalazione
ja: 有効にするとログアーカイブが問題レポートに添付されます
ko: 활성화하면 로그 아카이브가 문제 신고에 첨부됩니다
pt_pt: Ativar para anexar um arquivo de registos ao relatório de erro
zh_hans: 启用后将在错误报告中附加日志存档

# BugReportNewReport
source: New Problem Report
de: Neuer Problembericht
es: Nuevo informe de error
fr: Nouveau signalement de problème
it: Nuova segnalazione di problema
ja: 新しい問題レポート
ko: 새 문제 신고
pt_pt: Novo relatório de erro
zh_hans: 新建错误报告

# BugReportOpenedOnMainWindow
source: Problem report opened on the main window
de: Problembericht im Hauptfenster geöffnet
es: Informe de errores abierto en la ventana principal
fr: Signalement de problème ouvert dans la fenêtre principale
it: Segnalazione di problema aperta nella finestra principale
ja: メインウィンドウで問題レポートを開きました
ko: 메인 윈도우에서 문제 보고서가 열렸습니다
pt_pt: Relatório de erro aberto na janela principal
zh_hans: 错误报告已在主窗口中打开

# BugReportRemoveAttachment
source: Remove attachment
de: Anhang entfernen
es: Eliminar adjunto
fr: Supprimer la pièce jointe
it: Rimuovi allegato
ja: 添付ファイルを削除
ko: 첨부 파일 제거
pt_pt: Remover anexo
zh_hans: 移除附件

# BugReportSavedForRetry
source: Report saved — will send when online
de: Bericht gespeichert — wird gesendet, wenn online
es: Informe guardado — se enviará cuando esté en línea
fr: Rapport enregistré — sera envoyé en ligne
it: Segnalazione salvata — verrà inviata quando online
ja: レポートを保存しました — オンライン時に送信します
ko: 보고서 저장됨 — 온라인 시 전송됩니다
pt_pt: Relatório guardado — será enviado quando online
zh_hans: 报告已保存 — 联网后将自动发送

# BugReportSentSuccess
source: Report submitted successfully
de: Bericht erfolgreich gesendet
es: Informe enviado correctamente
fr: Rapport envoyé avec succès
it: Segnalazione inviata con successo
ja: レポートが送信されました
ko: 보고서가 성공적으로 제출되었습니다
pt_pt: Relatório enviado com sucesso
zh_hans: 报告提交成功

# BugReportSettingsDescription
source: Report an issue or provide feedback
de: Ein Problem melden oder Feedback geben
es: Informar de un problema o enviar comentarios
fr: Signaler un problème ou donner un avis
it: Segnala un problema o invia un feedback
ja: 問題の報告またはフィードバックの送信
ko: 문제 보고 또는 피드백 제공
pt_pt: Reportar um problema ou enviar comentários
zh_hans: 报告问题或提供反馈

# BugReportSettingsHint
source: Opens the problem report form
de: Öffnet das Problemberichtformular
es: Abre el formulario de informe de errores
fr: Ouvre le formulaire de signalement de problème
it: Apre il modulo di segnalazione del problema
ja: 問題レポートフォームを開きます
ko: 문제 신고 양식을 엽니다
pt_pt: Abre o formulário de relatório de erros
zh_hans: 打开错误报告表单

# BugReportSubmit
source: Submit
de: Senden
es: Enviar
fr: Envoyer
it: Invia
ja: 送信
ko: 제출
pt_pt: Enviar
zh_hans: 提交

# BugReportSubmitError
source: Failed to submit report
de: Bericht konnte nicht gesendet werden
es: Error al enviar el informe
fr: Échec de l'envoi du rapport
it: Invio della segnalazione non riuscito
ja: レポートの送信に失敗しました
ko: 보고서 제출 실패
pt_pt: Falha ao enviar o relatório
zh_hans: 报告提交失败

# BugReportSummaryLabel
source: Summary
de: Zusammenfassung
es: Resumen
fr: Résumé
it: Riepilogo
ja: 概要
ko: 요약
pt_pt: Resumo
zh_hans: 概要

# BugReportTitle
source: Report a problem
de: Problem melden
es: Reportar un problema
fr: Signaler un problème
it: Segnala un problema
ja: 問題を報告
ko: 문제 신고
pt_pt: Reportar um problema
zh_hans: 报告问题

# BugReportTitleLabel
source: Title
de: Titel
es: Título
fr: Titre
it: Titolo
ja: タイトル
ko: 제목
pt_pt: Título
zh_hans: 标题

# BugReportTitlePlaceholder
source: Brief summary of the issue
de: Kurze Zusammenfassung des Problems
es: Resumen breve del problema
fr: Résumé bref du problème
it: Breve riepilogo del problema
ja: 問題の簡単な概要
ko: 문제에 대한 간략한 요약
pt_pt: Resumo breve do problema
zh_hans: 问题简要概述

# BusyInviteMessage
source: is currently on another call.
de: ist gerade in einem anderen Gespräch.
es: Actualmente está en otra llamada.
fr: est actuellement sur un autre appel.
it: è attualmente su un'altra chiamata.
ja: は通話中です。
ko: 현재 다른 전화를 받고 있습니다.
pt_pt: está em outra chamada.
zh_hans: 正在通话中。

# CachingImagesInSwiftuiNotOnly
source: Caching images in SwiftUI not only enhances the performance of your application but also ensures a smoother and faster user experience. asyncImage library makes asynchronous image loading and caching simple and effective. By following the steps outlined above, you can easily integrate asynchronous image loading and caching into your SwiftUI application.
de: Das Caching von Bildern in SwiftUI verbessert nicht nur die Leistung Ihrer Anwendung, sondern sorgt auch für ein reibungsloseres und schnelleres Benutzererlebnis. Die asyncImage-Bibliothek macht das asynchrone Laden und Caching von Bildern einfach und effektiv. Mit den oben beschriebenen Schritten können Sie das asynchrone Laden und Caching von Bildern problemlos in Ihre SwiftUI-Anwendung integrieren.
es: El almacenamiento en caché de imágenes en SwiftUI no solo mejora el rendimiento de su aplicación, sino que también garantiza una experiencia de usuario más fluida y rápida. La biblioteca asyncImage hace que la carga asíncrona y el almacenamiento en caché de imágenes sean simples y efectivos. Siguiendo los pasos descritos anteriormente, puede integrar fácilmente la carga asíncrona y el almacenamiento en caché de imágenes en su aplicación SwiftUI.
fr: La mise en cache des images dans SwiftUI améliore non seulement les performances de votre application, mais garantit également une expérience utilisateur plus fluide et plus rapide. La bibliothèque asyncImage rend le chargement asynchrone et la mise en cache des images simples et efficaces. En suivant les étapes décrites ci-dessus, vous pouvez facilement intégrer le chargement asynchrone et la mise en cache des images dans votre application SwiftUI.
it: La memorizzazione nella cache delle immagini in SwiftUI non solo migliora le prestazioni dell'applicazione, ma garantisce anche un'esperienza utente più fluida e veloce. La libreria asyncImage rende il caricamento asincrono e la memorizzazione nella cache delle immagini semplici ed efficaci. Seguendo i passaggi sopra descritti, puoi facilmente integrare il caricamento asincrono e la memorizzazione nella cache delle immagini nella tua applicazione SwiftUI.
ja: SwiftUIで画像をキャッシュすることで、アプリケーションのパフォーマンスが向上するだけでなく、よりスムーズで高速なユーザーエクスペリエンスが保証されます。asyncImageライブラリにより、非同期画像読み込みとキャッシュが簡単かつ効果的になります。上記の手順に従うことで、SwiftUIアプリケーションに非同期画像読み込みとキャッシュを簡単に統合できます。
ko: SwiftUI에서 이미지 캐싱은 애플리케이션의 성능을 향상시킬 뿐만 아니라 더 부드럽고 빠른 사용자 경험을 보장합니다. asyncImage 라이브러리는 비동기 이미지 로딩과 캐싱을 간단하고 효과적으로 만들어줍니다. 위에 설명된 단계를 따르면 SwiftUI 애플리케이션에 비동기 이미지 로딩과 캐싱을 쉽게 통합할 수 있습니다.
pt_pt: O cache de imagens no SwiftUI não apenas melhora o desempenho da sua aplicação, mas também garante uma experiência de utilizador mais suave e rápida. A biblioteca asyncImage torna o carregamento assíncrono e o cache de imagens simples e eficazes. Seguindo os passos descritos acima, pode integrar facilmente o carregamento assíncrono e o cache de imagens na sua aplicação SwiftUI.
zh_hans: SwiftUI中的图像缓存不仅能提升应用性能，还能确保更流畅、更快速的用户体验。asyncImage库使异步图像加载和缓存变得简单高效。按照上述步骤，您可以轻松地将异步图像加载和缓存集成到您的SwiftUI应用中。

# CALL_BUSY_1053
source: User is currently on another call
de: Der Benutzer führt gerade ein anderes Gespräch
es: El usuario está actualmente en otra llamada
fr: L'utilisateur est actuellement sur un autre appel
it: L'utente è attualmente su un'altra chiamata
ja: ユーザーは通話中です
ko: 사용자가 현재 다른 전화를 받고 있습니다
pt_pt: O usuário está em outra chamada
zh_hans: 用户正在另一个通话中

# CallAnswered
source: Your call is answered.
de: Ihr Anruf wird entgegengenommen.
es: Su llamada ha sido contestada.
fr: Votre appel est répondu.
it: La tua chiamata riceve risposta.
ja: 発信が応答されます。
ko: 상대방이 전화를 수신중입니다
pt_pt: Sua chamada foi atendida.
zh_hans: 您的呼叫已被接通。

# CallBeRemovedMessage
source: A host has removed you from the {{app_name}} call.
de: Ein Host hat Sie aus dem Aufruf {{app_name}}
es: Un anfitrión te ha eliminado de la llamada {{app_name}}
fr: Un hôte vous a retiré de l'appel {{app_name}}
it: Un host ti ha rimosso dalla chiamata {{app_name}}
ja: {{app_name}}呼び出しからあなたを削除しました。
ko: {{app_name}} 호출에서 귀하를 제거했습니다.
pt_pt: Um host removeu você da chamada {{app_name}}
zh_hans: 主持人已将您从{{app_name}}通话中删除。

source: Call between
de: Anruf zwischen
es: Llamada entre
fr: Appel entre
it: Chiama tra
ja: 間の通話
ko: 통화 사이
pt_pt: Chamada entre
zh_hans: 参与通话

# CallCancelled
source: Cancelled
de: Abgebrochen
es: Cancelada
fr: Annulé
it: Annullata
ja: キャンセル済み
ko: 취소됨
pt_pt: Cancelada
zh_hans: 已取消

# CallCancelledMessage
source: Your call was cancelled.
de: Ihr Anruf wurde abgebrochen.
es: Su llamada fue cancelada.
fr: Appel a été refusé
it: La tua chiamata è stata cancellata.
ja: 呼び出しは取り消されました。
ko: 전화가 취소되었습니다.
pt_pt: Sua chamada foi cancelada.
zh_hans: 通话被取消。

# CallDeclinedMessage
source: Your call was declined.
de: Ihr Anruf wurde abgelehnt.
es: Su llamada fue rechazada.
fr: Appel a été refusé
it: La tua chiamata è stata rifiutata.
ja: 呼び出しは拒否されました。
ko: 전화가 거절되었습니다.
pt_pt: Sua chamada foi recusada.
zh_hans: 通话被拒绝。

# CallFailedMessage
source: Your call failed.
de: Ihr Anruf ist fehlgeschlagen.
es: Su llamada falló.
fr: Appel a échoué
it: La tua chiamata non è riuscita.
ja: 呼び出しに失敗しました。
ko: 전화가 실패했습니다.
pt_pt: Sua ligação falhou.
zh_hans: 通话失败。

# CallGroupFormat
source: Call %@
de: %@ anrufen
es: Llamar a %@
fr: Appeler %@
it: Chiama %@
ja: %@に発信
ko: %@ 통화
pt_pt: Ligar para %@
zh_hans: 呼叫%@

source: Call info
de: Anrufinfo
es: información de la llamada
fr: Informations sur l'appel
it: Info chiamate
ja: コール情報
ko: 전화 세부 사항
pt_pt: Informações de chamada
zh_hans: 通话信息

# CallInfoAddComment
source: Add a comment...
de: Einen Kommentar hinzufügen...
es: Añadir un comentario...
fr: Ajouter un commentaire...
it: Aggiungi un commento...
ja: コメントを追加...
ko: 코멘트를 추가...
pt_pt: Adicione um comentário...
zh_hans: 添加评论...

# CallQualityLabel
source: Call Quality
de: Anrufqualität
es: Calidad de la llamada
fr: Qualité des appels
it: Qualità delle chiamate
ja: ビデオ品質
ko: 통화 품질
pt_pt: Qualidade da chamada
zh_hans: 通话质量
